* TODO Morning Routine [100%] [9/9]
:PROPERTIES:
DEADLINE: <2023-11-22 Wed>
:END:
- [X] Prayer/Lectionary/Lives of the Saints
- [X] Hygiene
- [X] Made bed
- [X] Mobility/Strength
  + /What did you do?/ 
    Will go to the gym and do some oly lifting (yay!)

    didn't do too much, could've done more.
- [X] *Morning reflection*
  + /What are your thoughts?/
    I wasted this entire morning, but now I have the rest of today to work
    on things so let's get to work.
- [X] *Morning intention*
  + /Overall focus of today?/
    Getting work done, a large variety instead of focusing on one particular thing.
- [X] *Morning creativity*
  + /Feeling creative or smart?/
    I'm feeling smart. 1 divided by some number is that number to the negative -1. (any other number than one would just multiply
    this number with the negative exponent.) So to find that specific # (assuming you just have the decimal version of this fraction)
    You could find the reciprocal of that # (1 divided by said #) then square the number, and finally multiply it by the original decimal.

    ex:
    #+begin_src python :results output
      def main():
          print('One over what # is equal to d?\n')
          d = 9.0
          print(f'd = {d}')
          print(f'The reciprocal of d squared = {reciprocal_of_d(d)}')
          y = reciprocal_of_d(d)
          equation(d, y)

      def reciprocal_of_d(d):
          y = (1 / d)*(1 / d)
          return y

      def equation(d, y):
         print(f'{d} * {y} = {d * y}') 
         print(f'The most simpified version of the fraction: 1 / {d * y} = {1 / (d * y)}')
         print(f'\nThe answer: {d * y: .10f}')

      main()
    #+end_src

    #+RESULTS:
    : One over what # is equal to d?
    : 
    : d = 9.0
    : The reciprocal of d squared = 0.012345679012345678
    : 9.0 * 0.012345679012345678 = 0.1111111111111111
    : The most simpified version of the fraction: 1 / 0.1111111111111111 = 9.0
    : 
    : The answer:  0.1111111111
- [X] Start planning today and use agenda to help
- [X] git push before leaving 
  make sure you take everything you need for the day
* TODO [#A] Today's goals [66%] [6/9]
:PROPERTIES:
DEADLINE: <2023-11-22 Wed>
:END:
- [X] Prayer rope/book
- [ ] Read/Note 10 pages or Read 20 pages of book
  - Input book(s) and all info here:
- [X] call a friend/family member
- [X] Duolingo
- [X] Practice touch typing
- [X] create TODOs for agenda
- [ ] foundations paper 3
- [X] python midterm take-home
  got started on it, will wait for new laptop to run pygame better and be able
  to write code with vim, because pythons IDLE is horrible... 

  This means I work over-time on other projects, because I
  will be "behind" on python both for midterm exam and pygame
- [ ] calc homework
* *IMPORTANT*
We have been slacking on work this whole day, it is now 3 o'clock,
the rest of the day let's be hard at work. No cell phone, no
distractions, just hard work, let's get it.
* TODO Evening Routine [0%] [0/8]
:PROPERTIES:
DEADLINE: <2023-11-22 Wed>
:END:
- [ ] Make sure all daily goals are met 
- [ ] Mobility/Isometrics
  + /What did you do?/
- [ ] *Evening reflection*
  + /How's it all going?/
- [ ] *Evening thanks*
  + /How've you been blessed today?/
- [ ] *Evening creativity*
  + /What do you want to express?/
- [ ] Hygiene
- [ ] Prayer
- [ ] 7:30+ hours of sleep
